miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/hw/r_usb_preg_abs.c
#else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        USB_M0.INTSTS0.WORD = (uint16_t)~USB_SOFR;

#endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        *type = USB_INT_SOFR;
    }

    /***** Processing device state *****/
    /***** DVST change *****/
    else if ((ists0 & USB_DVST) == USB_DVST)
    {
        /* DVST clear */
#if USB_CFG_USE_USBIP == USB_CFG_IP1
        USB_M1.INTSTS0.WORD = (uint16_t)~USB_DVST;

#else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        USB_M0.INTSTS0.WORD = (uint16_t)~USB_DVST;

#endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        *type = USB_INT_DVST;
        *status = intsts0;
    }

    /***** Processing PIPE0 data *****/
    else if ((USB_BRDY == (ists0 & USB_BRDY)) && ((USB_BRDY0) == (bsts & USB_BRDY0)))
    {
#if USB_CFG_USE_USBIP == USB_CFG_IP1
        USB_M1.BRDYSTS.WORD = (uint16_t) ((~USB_BRDY0) & BRDYSTS_MASK);

#else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        USB_M0.BRDYSTS.WORD = (uint16_t) ((~USB_BRDY0) & BRDYSTS_MASK);

#endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        *type = USB_INT_BRDY;
        *status = USB_BRDY0;
    }
    else if ((USB_BEMP == (ists0 & USB_BEMP)) && (USB_BEMP0 == (ests & USB_BEMP0)))
    {
#if USB_CFG_USE_USBIP == USB_CFG_IP1
        USB_M1.BEMPSTS.WORD = (uint16_t) ((~USB_BEMP0) & BEMPSTS_MASK);

#else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        USB_M0.BEMPSTS.WORD = (uint16_t) ((~USB_BEMP0) & BEMPSTS_MASK);

#endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        *type = USB_INT_BEMP;
        *status = USB_BEMP0;
    }
    else if ((USB_NRDY == (ists0 & USB_NRDY)) && (USB_NRDY0 == (nsts & USB_NRDY0)))
    {
#if USB_CFG_USE_USBIP == USB_CFG_IP1
        USB_M1.NRDYSTS.WORD = (uint16_t) ((~USB_NRDY0) & NRDYSTS_MASK);

#else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        USB_M0.NRDYSTS.WORD = (uint16_t) ((~USB_NRDY0) & NRDYSTS_MASK);

#endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        *type = USB_INT_NRDY;
        *status = USB_NRDY0;
    }

    /***** Processing setup transaction *****/
    else if (USB_CTRT == (ists0 & USB_CTRT))
    {
        /* CTSQ bit changes later than CTRT bit for ASSP. */
        /* CTSQ reloading */
        *status = hw_usb_read_intsts();

        /* USB_CTRT clear */
#if USB_CFG_USE_USBIP == USB_CFG_IP1
        USB_M1.INTSTS0.WORD = (uint16_t)~USB_CTRT;

#else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        USB_M0.INTSTS0.WORD = (uint16_t)~USB_CTRT;

#endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        *type = USB_INT_CTRT;

        if (USB_CS_SQER == (uint8_t)((*status) & USB_CTSQ))
        {
            hw_usb_pclear_sts_valid();
            *type = USB_INT_UNKNOWN;
            *status = 0;
            return;
        }
    }

    /***** Processing PIPE1-MAX_PIPE_NO data *****/
    else if (USB_BRDY == (ists0 & USB_BRDY))
    {
#if USB_CFG_USE_USBIP == USB_CFG_IP1
        USB_M1.BRDYSTS.WORD = (uint16_t) ((~bsts) & BRDYSTS_MASK);

#else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        USB_M0.BRDYSTS.WORD = (uint16_t) ((~bsts) & BRDYSTS_MASK);

#endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        *type = USB_INT_BRDY;
        *status = bsts;
    }
    else if (USB_BEMP == (ists0 & USB_BEMP))
    {
#if USB_CFG_USE_USBIP == USB_CFG_IP1
        USB_M1.BEMPSTS.WORD = (uint16_t) ((~ests) & BEMPSTS_MASK);

#else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        USB_M0.BEMPSTS.WORD = (uint16_t) ((~ests) & BEMPSTS_MASK);

#endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        *type = USB_INT_BEMP;
        *status = ests;
    }
    else if (USB_NRDY == (ists0 & USB_NRDY))
    {
#if USB_CFG_USE_USBIP == USB_CFG_IP1
        USB_M1.NRDYSTS.WORD = (uint16_t) ((~nsts) & NRDYSTS_MASK);

#else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        USB_M0.NRDYSTS.WORD = (uint16_t) ((~nsts) & NRDYSTS_MASK);

#endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
        *type = USB_INT_NRDY;
        *status = nsts;
    }
    else
    {
        /* Non processing. */
    }
}
/******************************************************************************
 End of function usb_pstd_interrupt_handler
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_save_request
 Description     : Save received USB command.
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void usb_pstd_save_request(void)
{
    /* Valid clear */
    hw_usb_pclear_sts_valid();

    g_usb_pstd_req_type = hw_usb_read_usbreq();
    g_usb_pstd_req_value = hw_usb_read_usbval();
    g_usb_pstd_req_index = hw_usb_read_usbindx();
    g_usb_pstd_req_length = hw_usb_read_usbleng();
}
/******************************************************************************
 End of function usb_pstd_save_request
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_chk_configured
 Description     : Check if USB Device is in a CONFIGURED state.
 Arguments       : none
 Return value    : Configuration state (YES/NO)
 ******************************************************************************/
uint16_t usb_pstd_chk_configured(void)
{
    uint16_t buf;

    buf = hw_usb_read_intsts();

    /* Device Status - Configured check */
    if ((buf & USB_DVSQ) == USB_DS_CNFG)
    {
        /* Configured */
        return USB_TRUE;
    }
    else
    {
        /* not Configured */
        return USB_FALSE;
    }
}
/******************************************************************************
 End of function usb_pstd_chk_configured
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_remote_wakeup
 Description     : Set the USB peripheral to implement remote wake up.
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void usb_pstd_remote_wakeup(void)
{
    uint16_t buf;

    g_usb_pstd_remote_wakeup_state = USB_ERROR;

    /* Support remote wakeup ? */
    if (USB_TRUE == g_usb_pstd_remote_wakeup)
    {
        /* RESM interrupt disable */
        hw_usb_pclear_enb_rsme();

